[{"title":"","date":"2017-02-19T13:56:42.000Z","path":"2017/02/19/要尝试逃离上广深了么？/","text":"#要尝试逃离上广深了么？2017年2月19日了，这天比预期的时间晚来了30天，30天前我告诉自己，要弄一个个人站点，不管这个站点的Theme是从哪个大牛手里偷的，都要先用着。 本来在现有的Hexo成熟的框架条件下，个人博客最多20分钟就可以弄好，但是我却花了比我预期多的多的时间。这些事件都耗费在哪了？耗费在不够专注：上班修改优化项目零碎的时间里，Hexo安装错误，一波接着一波的安装卸载，GitHub Pages删了又重新添加，全是无用之功。 上周五4个面试还毫无消息，Cisco上海的技术面问了我很多基础的东西，我模凌两可含含糊糊的回答，26分钟就从大厦出来，我想也是应该的，从没有如此草率的面试，毫无准备，必然不会受到待见。可是为啥我要把自己的实力不足归咎于准备不充分呢？没有什么台阶要给自己下的。自己无能是原罪。那天下午在浦东张江高科，那个逆向开发公司的技术面和我聊了20多分钟，问我最近研究什么，问我最近开发上的难点有哪些，我一五一十的说着，后来问我：你会给iPhone越狱嘛？我说我没做过的时候他合起了他的Mac，我想这已经终结聊天了，我也本想抱着试试的态度来的，底层汇编我又没那个能力去做，不被待见显而易见，但是第一次面试和别人聊天不在同一个频道的时候，让我感觉空气里到处弥漫着尴尬。 之后我坐在老甲公司楼下的台阶上吹冷风，手机没电我打开Mac给它喂奶，我好气的，好不容易编了个很奇葩的理由请假面试，却被自己白白糟蹋一天。我告诉自己都会好的，就像春天来了，柳絮会飘，秋天过来，柿子会熟。少年你不能太着急的。我安慰自己啊，别急，你可以的，这个世界本来就给你留好了位置，你还没遇到最好的自己。可是没用的啊，那天风好大，鼻子好酸，眼角都湿得一直没干，自我安慰的那些屁话肯定没有老甲带我去吃那顿热气腾腾的麻辣烫管用，张江高科消费好贵的，0.8公斤的料，48块钱，温饱了那天我饥饿的灵魂。 大概是太过于急功近利。技术需要沉淀的，一点点去学，代码要慢慢的打磨，一行行的敲，这个膨胀的社会却不给年轻人那么多时间去沉淀，膨胀的自己也不给自己那么多机会去尝试。 2016年的每一天我都掰开着用，这一年我都没时间去做噩梦，忙得让我很少在半夜里会醒来，往往都是半夜才睡。那个时候我告诉自己，你要努力，你现在多累些，当下就少求别人一点。下半年项目加班加点，干过40多个小时没合眼，我也不曾抱怨，因为毕竟自己菜，只能用时间来弥补，我把别人喝咖啡的时候都用来写项目了。我庆幸我足够的年轻，年轻到身体严重负荷的时候，仅仅只是胸口有点痛而已。一觉醒来，代码还可以撸的飞起。 TinyTian说代码是我大老婆，她是小三，满是哀怨。我只能咧开嘴笑，的确我欠她太多的时间。那些赶项目上架的日子里，都是半夜留言给她让她第二天几点做我的闹钟。有时候我在想，幸福的日子就是有一个人成了你这一生唯一的软肋，遇事再也不莽撞，即使丢掉激情你也不会觉得后悔。好寡淡的时光啊，可你就是这么心安理得的欢喜。 有时候很多事情来的莫名其妙，中午在地铁上打瞌睡打盹点开Boss聊了一个，立马要了简历，后来才知道那是合肥的一家美容公司。紧接着下午就视讯通话面试过了，傍晚给我发了Offer，在合肥，试用期税前9K，转正11K，可是我不知道为啥高兴不起来。我好纠结的，我就是一个矫情的贱人啊。我好贪恋一线城市夜晚的霓虹灯啊，我总是告诉自己一线城市机会多，技术提升快。可是我为啥还是很纠结呢，很迷惘呢？迟点早点终究要回到那个城市的，为何你现在不早点考虑，非要给自己慢慢不切实际的幻想呢？ 现在这个机会就摆在我的面前了，我却踌躇满志，迈不开步子。还有后退一步的机会的，大不了返沪从头再来，又何妨？反正我的时间又不值钱，可以大把的浪费大把的挥霍啊。 年轻就是要这样的吧，都不确定，都在准备呢，试试又不是一个坏事，何况又不是最惨的时候。还有那么多希望。","tags":[]},{"title":"Hello World","date":"2017-02-19T02:47:04.000Z","path":"2017/02/19/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]