[{"title":"一个iOS开发者在做人脸识别(一)","date":"2017-02-20T02:01:22.000Z","path":"2017/02/20/一个iOS开发者在做人脸识别-一/","text":"写在前面: 2016年上半年在上海面试的时候。徐汇区有一家做社交的互联网公司开始打算做人脸识别，由此我了解了深圳脸萌科技的FaceU这款超级激萌的App。很有意思的是徐汇区那家社交公司面试我的时候跟我说的很明确：你做一个类似FaceU的demo给我，我就给你发Offer。有时候我在想一份工作好简单啊，只要你会做人脸识别添加贴纸贴片，一碗饭就来了。 回去之后，我对比了iOS框架自带的人脸识别框架识别的精度不够高，侧脸极其难识别，我只好放弃转而奔向科大讯飞人脸识别的框架去做。 那一个礼拜的时间里，我看科大讯飞的人脸识别SDK和官方Demo，在做识别的过程中想加贴片装饰品的时候，遇到了二个代理方法的冲突，导致某个识别状态始终无法修改。所以那次的demo最终是没有做出来。 时隔快一年，我想人脸识别功能我该动一动了，恰好个人技术博客刚开张，也应该来一点技术干货。同时不一样的是，这次我也不打算用科大讯飞的框架，我想从OpenCV的开源库着手，多多少少还可以学点C++的函数也还不错。 由此我想把研究人脸识别的过程记录下来。所以这个系列是一个不懂C++的iOS开发小白的学习过程。 本系列文章，所有测试内容以及demo的环境如下： 1）Xcode Version 8.2.1 2）OpenCV for iOS 3.2.0 准备工作： 1）先去OpenCV官网下载最新的OpenCV For iOS的视觉库。 2）Xcode创建一个新的项目，把下载的OpenCV库导入工程，并在工程的Building phase里面添加opencv2.framework。 如果对OpenCV有所了解的会知道，OpenCV的代码是基于C++编写的。因此，想要在Xcode项目中运行C++代码，你需要把文件名后缀名由.m改成.mm即可（当然最好把OpenCV的功能函数写一层OC的API封装，这样可能会比较安全，也会少很多不必要的错误麻烦，也更符合开发需求。）。 注意：OpenCV 声明了命名空间 cv，因此 OpenCV 的类的前面会有个 cv:: 前缀，就像 cv::Mat、 cv::Algorithm 等等。你也可以在 .mm 文件中使用 using namespace cv 来避免在一堆类名前使用 cv:: 前缀。 但是，在某些类名前你必须使用命名空间前缀，比如 cv::Rect 和 cv::Point，因为它们会跟定义在 MacTypes.h 中的 Rect 和 Point 相冲突。尽管这只是个人偏好问题，个人偏向在任何地方都使用 cv:: 以保持一致性。 辅助理解内容部分： C++ 命名空间namespace的作用和使用 命名空间是ANSIC++引入的可以由用户命名的作用域，用来处理程序中 常见的同名冲突。其作用就是规定该文件中使用的标准库函数都是在标准命名空间std中定义的。通常来说，在C++中，命名空间（namespace）的目的是为了防止名字冲突。每个命名空间是一个作用域，在所有命名空间之外，还存在一个全局命名空间（global namespace），全局命名空间以隐式的方式声明，它并没有名字。在命名空间机制中，原来的全局变量，就是位于全局命名空间中（可以用::member的形式表示）。 在C语言中定义了3个层次的作用域，即文件(编译单元)、函数和复合语句。C++在C的基础上又引入了类作用域，类是出现在文件内的。在不同的作用域中可以定义相同名字的变量，互不于扰，系统能够区别它们。 在导入opencv2.framework之后，把你需要加入OpenCV代码的文件的.m文件后缀由.m改成.mm 引入头文件 #import &lt;opencv2/opencv.hpp&gt; #import &lt;opencv2/imgproc/types_c.h&gt; #import &lt;opencv2/imgcodecs/ios.h&gt; 编译运行。 PS:我编译的时候，有二个报错。经过查阅资料做了具体的修改调整之后可以正常运行，分别是OpenCV库的 blenders.hpp 文件 enum { NO, FEATHER, MULTI_BAND }; 修改成： enum { NO_EXPOSURE_COMPENSATOR, FEATHER, MULTI_BAND }; 和exposure_compensate.hpp文件 enum { NO, GAIN, GAIN_BLOCKS }; 修改成： enum { NO_EXPOSURE_COMPENSATOR, GAIN, GAIN_BLOCKS }; 先来试试OpenCV的入门内容，把一张彩色图片变成灰色的 再控制器的.mm文件中引入Mat类 @interface ViewController () { cv::Mat cvImage; } @end 关于Mat类的调研: 现在在你的.mm控制器里引入CascadeClassifier类 @interface ViewController () { cv::CascadeClassifier faceDetector; } @end 关于CascadeClassifier类的调研: CascadeClassifier为OpenCV中cv namespace下用来做目标检测的级联分类器的一个类。该类中封装的目标检测机制，简而言之是滑动窗口机制+级联分类器的方式。OpenCV的早期版本中仅支持haar特征的目标检测，分别在2.2和2.4.0（包含）之后开始支持LBP和HOG特征的目标检测。 我个人暂时的理解是：这个类就是一个目标检测类，它可以检测目标 以后有时间再详细看一下CascadeClassifier类的运行和原理，先立一个flag。","tags":[{"name":"研习","slug":"研习","permalink":"http://yoursite.com/tags/研习/"},{"name":"人脸识别","slug":"人脸识别","permalink":"http://yoursite.com/tags/人脸识别/"},{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"},{"name":"OpenCV","slug":"OpenCV","permalink":"http://yoursite.com/tags/OpenCV/"}]},{"title":"要尝试逃离上广深了么？","date":"2017-02-19T13:53:20.000Z","path":"2017/02/19/要尝试逃离上广深了么？/","text":"2017年2月19日了，这天比预期的时间晚来了30天，30天前我告诉自己，要弄一个个人站点，不管这个站点的Theme是从哪个大牛手里偷的，都要先用着。 本来在现有的Hexo成熟的框架条件下，个人博客最多20分钟就可以弄好，但是我却花了比我预期多的多的时间。这些事件都耗费在哪了？耗费在不够专注：上班修改优化项目零碎的时间里，Hexo安装错误，一波接着一波的安装卸载，GitHub Pages删了又重新添加，全是无用之功。 2月17日的4个面试还毫无消息，Cisco上海的技术面问了我很多基础的东西，我模凌两可含含糊糊的回答，26分钟就从大厦出来，我想也是应该的，从没有如此草率的面试，毫无准备，必然不会受到待见。可是为啥我要把自己的实力不足归咎于准备不充分呢？没有什么台阶要给自己下的。自己无能是原罪。那天下午在浦东张江高科，那个逆向开发公司的技术面和我聊了20多分钟，问我最近研究什么，问我最近开发上的难点有哪些，我一五一十的说着，后来问我：你会给iPhone越狱嘛？我说我没做过的时候他合起了他的Mac，我想这已经终结聊天了，我也本想抱着试试的态度来的，底层汇编我又没那个能力去做，不被待见显而易见，但是第一次面试和别人聊天不在同一个频道的时候，让我感觉空气里到处弥漫着尴尬。 之后我坐在老甲公司楼下的台阶上吹冷风，手机没电我打开Mac给它喂奶，我好气的，好不容易编了个很奇葩的理由请假面试，却被自己白白糟蹋一天。我告诉自己都会好的，就像春天来了，柳絮会飘，秋天过来，柿子会熟。少年你不能太着急的。我安慰自己啊，别急，你可以的，这个世界本来就给你留好了位置，你还没遇到最好的自己。可是没用的啊，那天风好大，鼻子好酸，眼角都湿得一直没干，自我安慰的那些屁话肯定没有老甲带我去吃那顿热气腾腾的麻辣烫管用，张江高科消费好贵的，0.8公斤的料，48块钱，温饱了那天我饥饿的灵魂。 大概是太过于急功近利。技术需要沉淀的，一点点去学，代码要慢慢的打磨，一行行的敲，这个膨胀的社会却不给年轻人那么多时间去沉淀，膨胀的自己也不给自己那么多机会去尝试。 2016年的每一天我都掰开着用，这一年我都没时间去做噩梦，忙得让我很少在半夜里会醒来，往往都是半夜才睡。那个时候我告诉自己，你要努力，你现在多累些，当下就少求别人一点。下半年项目加班加点，干过40多个小时没合眼，我也不曾抱怨，因为毕竟自己菜，只能用时间来弥补，我把别人喝咖啡的时候都用来写项目了。我庆幸我足够的年轻，年轻到身体严重负荷的时候，仅仅只是胸口有点痛而已。一觉醒来，代码还可以撸的飞起。 TinyTian说代码是我大老婆，她是小三，满是哀怨的时候我只能咧开嘴笑，的确我欠她太多的时间。有时候我在想，幸福的日子就是有一个人成了你这一生唯一的软肋，遇事再也不莽撞，即使丢掉激情你也不会觉得后悔。好寡淡的时光啊，可就是这么心安理得的欢喜。 有时候很多事情来的莫名其妙，中午在地铁上打瞌睡打盹点开Boss聊了一个，立马要了简历，后来才知道那是合肥的一家美容公司。紧接着下午就视讯通话面试过了，傍晚给我发了Offer，在合肥，试用期税前9K，转正11K，可是我不知道为啥高兴不起来呢，是我过于贪恋一线城市夜晚的霓虹灯么，总是在心里告诉自己一线城市机会多，技术提升快。可是迟早终究要回到那个城市的，为何不早做打算，非要漫无目的的幻想么？ 现在这个机会就摆在我的面前了，我却踌躇满志，迈不开步子。可这又算什么呢？反正我的时间又不值钱，可以大把的浪费大把的挥霍。 年轻就是要这样的吧，都不确定，都在准备呢，试试又不是一个坏事，何况又不是最惨的时候。 毕竟还有那么多希望。","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"},{"name":"Hexo + Github Pages","slug":"Hexo-Github-Pages","permalink":"http://yoursite.com/tags/Hexo-Github-Pages/"}]}]